import 'package:flutter/material.dart';
import 'azkar.dart';

class ListOfStrings extends StatelessWidget {
  final List<Widget> litems = [
    Azkar(
      title: 'Утренний азкар № 1',
      textOnArabic:
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ،أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
      textOnRussian:
          'О Аллах, Ты - Господь мой, и нет бога, кроме Тебя, Ты создал меня, а я -Твой раб, и я буду хранить верность Тебе, пока у меня хватит сил. Прибегаю к Тебе от зла того, что я сделал, признаю милость, оказанную Тобой мне, и признаю грех свой. Прости же меня, ибо, поистине, никто не прощает грехов, кроме Тебя',
      transcription:
          'Аллахумма, Анта Рабби, ля иляха илля Анта, халякта-ни ва ана \'абду-кя, ва ана "аля \'ахди-кя ва ва\'ди-кя ма-стата\'ту. А\'узу би-кя мин шарри ма сана\'ту, абу\'у ля-кя би-ни\'мати-кя \'аляййя,ва абу\'у би-занби, фа-гфир ли, фа-инна-ху ля йагфи-ру-з-зунуба илля Акта',
    ),
    Azkar(
      title: 'Утренний азкар № 2',
      textOnArabic:
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
      textOnRussian:
          'О Аллах, Ты - Господь мой, и нет бога, кроме Тебя, Ты создал меня, а я -Твой раб, и я буду хранить верность Тебе, пока у меня хватит сил. Прибегаю к Тебе от зла того, что я сделал, признаю милость, оказанную Тобой мне, и признаю грех свой. Прости же меня, ибо, поистине, никто не прощает грехов, кроме Тебя',
      transcription:
          'Аллахумма, Анта Рабби, ля иляха илля Анта, халякта-ни ва ана \'абду-кя, ва ана "аля \'ахди-кя ва ва\'ди-кя ма-стата\'ту. А\'узу би-кя мин шарри ма сана\'ту, абу\'у ля-кя би-ни\'мати-кя \'аляййя,ва абу\'у би-занби, фа-гфир ли, фа-инна-ху ля йагфи-ру-з-зунуба илля Акта',
    ),
  ];

  @override
  Widget build(BuildContext context) {
    return Container(
      child: ListView.builder(
          itemCount: litems.length,
          itemBuilder: (BuildContext ctxt, int index) {
            return litems[index];
          }),
    );
  }
}
